### B. Заезд

<table>
 <tr>
    <td>Ограничение времени</td>
    <td>1 секунда</td>
 </tr>
 <tr>
    <td>Ограничение памяти</td>
    <td>256Mb</td>
 </tr>
</table> 

На кольцевой трассе расположены n гоночных автомобилей. Наша цель оценить зрелищность заезда — количество обгонов в будущей гонке! Для простоты будем считать, что все автомобили стартуют в одно время из одной точки и движутся с постоянной скоростью: скорость i-го автомобиля vi. Определите количество обгонов, которые совершит автомобиль с номером 1, за время t, если длина кольцевого трека равна s. Обратите внимание, что в один момент времени автомобиль может совершить сразу несколько обгонов. Автомобили, находящиеся в одной точке в момент времени 0 и t, не совершают обгонов.

**Формат ввода**  
В первой строке записаны три целых числа n, t и s (2 ≤ n ≤ 1000000, 1 ≤ t,s ≤ 1000000).  
Во второй строке записаны n целых чисел v<sub>1</sub>, v<sub>2</sub>, …, v<sub>n</sub>(1 ≤ v<sub>i</sub> ≤ 1000000). Все v<sub>i</sub> различны.

**Формат вывода**  
Выведите количество обгонов в предстоящем заезде.

<table>
 <tr>
    <th>Тестовые данные</th>
    <th>Ожидаемый результат</th>
 </tr>
 <tr>
    <td>
    <br>5 10 10</br>
    <br>10 2 3 4 5</br>
    </td>
    <td>22</td>
 </tr>
  <tr>
<td>
    <br>10 10 10</br>
<br>1 2 3 4 5 6 7 8 9 10</br>
  </td>
  <td>0</td>
  </tr>
  <tr>
    <td>
      <br>2 1 1</br>
<br>1000000 1</br>
    </td>
    <td>
      999998
    </td>
  </tr>
  
</table>  

``` python
import math

def is_equal(x, y):
    return abs(x - y) < 1e-6

def main():
    n, t, s = map(int, input().split())

    speeds = list(map(int, input().split()))
    res = 0

    v = speeds[0]

    for i in range(1, n):
        if v > speeds[i]:
            s1 = v * t / s
            s2 = speeds[i] * t / s

            N = int(s1 - s2)

            res += N
            # if s1 - math.floor(s1) == s2 - math.floor(s2):
            if is_equal(s1 - math.floor(s1), s2 - math.floor(s2)):
                res -= 1

    print(res)

if __name__ == "__main__":
    main()
```
